#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main1To1() {
	// 알고리즘 분석 : 좋은 알고리즘과 데이터 구조를 설계하는 것 
	// 원시작업이란 : 알고리즘에 의해 수행되는 기본적인 계산들

	// 실험 결과는 실험에 포함되지 않은 입력에 대한 실행시간이 
	// 제대로 반영되지 않을 수도 있다.

	// 동일한 하드웨어와 소프트웨어 환경으로 측정해야 한다.
	// HW : processor, clock rate, memory, disk 등
	// SW : OS, programming language, compiler 등

	// 의사코드(pseudo-code) : 알고리즘을 설명하기 위한 고급언어
	// 임의접근기계모델 : 무제한의 메모리셀 각각의 셀은 임의의 수나 문자
	// 데이터를 저장함

	// 원시작업이란: 알고리즘에 의해 수행되는 기본적인 계산들
	// Ex) exp, ass, ind, cal, ret

	// 원시작업 수 세기 :
	// 의사코드를 조사함으로써, 알고리즘에 의해  실행되는 원시작업의
	// 최대 개수를 입력크기의 함수 형태로 결정할 수 있다.

	// Big-Oh 표기법은 함수의 증가율의 상한을 나타낸다.
	// Big-Omega 표기법은 함수의 증가율의 하한을 나타낸다.
	// Big-Theta 표기법은 함수의 증가율의 상한과 하한을 나타낸다.

	return 0;
}
